pkwasniok/avr-db-template/lib/atpack/avrasm/inc/AVR16DU28def.inc
; ADC_SAMPLE masks
.equ ADC_SAMPLE_gm = 0xFFFF              ; ADC Sample group mask
.equ ADC_SAMPLE_gp = 0                   ; ADC Sample group position
.equ ADC_SAMPLE_0_bm = (1<<0)            ; ADC Sample bit 0 mask
.equ ADC_SAMPLE_0_bp = 0                 ; ADC Sample bit 0 position
.equ ADC_SAMPLE_1_bm = (1<<1)            ; ADC Sample bit 1 mask
.equ ADC_SAMPLE_1_bp = 1                 ; ADC Sample bit 1 position
.equ ADC_SAMPLE_2_bm = (1<<2)            ; ADC Sample bit 2 mask
.equ ADC_SAMPLE_2_bp = 2                 ; ADC Sample bit 2 position
.equ ADC_SAMPLE_3_bm = (1<<3)            ; ADC Sample bit 3 mask
.equ ADC_SAMPLE_3_bp = 3                 ; ADC Sample bit 3 position
.equ ADC_SAMPLE_4_bm = (1<<4)            ; ADC Sample bit 4 mask
.equ ADC_SAMPLE_4_bp = 4                 ; ADC Sample bit 4 position
.equ ADC_SAMPLE_5_bm = (1<<5)            ; ADC Sample bit 5 mask
.equ ADC_SAMPLE_5_bp = 5                 ; ADC Sample bit 5 position
.equ ADC_SAMPLE_6_bm = (1<<6)            ; ADC Sample bit 6 mask
.equ ADC_SAMPLE_6_bp = 6                 ; ADC Sample bit 6 position
.equ ADC_SAMPLE_7_bm = (1<<7)            ; ADC Sample bit 7 mask
.equ ADC_SAMPLE_7_bp = 7                 ; ADC Sample bit 7 position
.equ ADC_SAMPLE_8_bm = (1<<8)            ; ADC Sample bit 8 mask
.equ ADC_SAMPLE_8_bp = 8                 ; ADC Sample bit 8 position
.equ ADC_SAMPLE_9_bm = (1<<9)            ; ADC Sample bit 9 mask
.equ ADC_SAMPLE_9_bp = 9                 ; ADC Sample bit 9 position
.equ ADC_SAMPLE_10_bm = (1<<10)          ; ADC Sample bit 10 mask
.equ ADC_SAMPLE_10_bp = 10               ; ADC Sample bit 10 position
.equ ADC_SAMPLE_11_bm = (1<<11)          ; ADC Sample bit 11 mask
.equ ADC_SAMPLE_11_bp = 11               ; ADC Sample bit 11 position
.equ ADC_SAMPLE_12_bm = (1<<12)          ; ADC Sample bit 12 mask
.equ ADC_SAMPLE_12_bp = 12               ; ADC Sample bit 12 position
.equ ADC_SAMPLE_13_bm = (1<<13)          ; ADC Sample bit 13 mask
.equ ADC_SAMPLE_13_bp = 13               ; ADC Sample bit 13 position
.equ ADC_SAMPLE_14_bm = (1<<14)          ; ADC Sample bit 14 mask
.equ ADC_SAMPLE_14_bp = 14               ; ADC Sample bit 14 position
.equ ADC_SAMPLE_15_bm = (1<<15)          ; ADC Sample bit 15 mask
.equ ADC_SAMPLE_15_bp = 15               ; ADC Sample bit 15 position

; ADC_WINLT masks
.equ ADC_WINLT_gm = 0xFFFF               ; Window Low Threshold group mask
.equ ADC_WINLT_gp = 0                    ; Window Low Threshold group position
.equ ADC_WINLT_0_bm = (1<<0)             ; Window Low Threshold bit 0 mask
.equ ADC_WINLT_0_bp = 0                  ; Window Low Threshold bit 0 position
.equ ADC_WINLT_1_bm = (1<<1)             ; Window Low Threshold bit 1 mask
.equ ADC_WINLT_1_bp = 1                  ; Window Low Threshold bit 1 position
.equ ADC_WINLT_2_bm = (1<<2)             ; Window Low Threshold bit 2 mask
.equ ADC_WINLT_2_bp = 2                  ; Window Low Threshold bit 2 position
.equ ADC_WINLT_3_bm = (1<<3)             ; Window Low Threshold bit 3 mask
.equ ADC_WINLT_3_bp = 3                  ; Window Low Threshold bit 3 position
.equ ADC_WINLT_4_bm = (1<<4)             ; Window Low Threshold bit 4 mask
.equ ADC_WINLT_4_bp = 4                  ; Window Low Threshold bit 4 position
.equ ADC_WINLT_5_bm = (1<<5)             ; Window Low Threshold bit 5 mask
.equ ADC_WINLT_5_bp = 5                  ; Window Low Threshold bit 5 position
.equ ADC_WINLT_6_bm = (1<<6)             ; Window Low Threshold bit 6 mask
.equ ADC_WINLT_6_bp = 6                  ; Window Low Threshold bit 6 position
.equ ADC_WINLT_7_bm = (1<<7)             ; Window Low Threshold bit 7 mask
.equ ADC_WINLT_7_bp = 7                  ; Window Low Threshold bit 7 position
.equ ADC_WINLT_8_bm = (1<<8)             ; Window Low Threshold bit 8 mask
.equ ADC_WINLT_8_bp = 8                  ; Window Low Threshold bit 8 position
.equ ADC_WINLT_9_bm = (1<<9)             ; Window Low Threshold bit 9 mask
.equ ADC_WINLT_9_bp = 9                  ; Window Low Threshold bit 9 position
.equ ADC_WINLT_10_bm = (1<<10)           ; Window Low Threshold bit 10 mask
.equ ADC_WINLT_10_bp = 10                ; Window Low Threshold bit 10 position
.equ ADC_WINLT_11_bm = (1<<11)           ; Window Low Threshold bit 11 mask
.equ ADC_WINLT_11_bp = 11                ; Window Low Threshold bit 11 position
.equ ADC_WINLT_12_bm = (1<<12)           ; Window Low Threshold bit 12 mask
.equ ADC_WINLT_12_bp = 12                ; Window Low Threshold bit 12 position
.equ ADC_WINLT_13_bm = (1<<13)           ; Window Low Threshold bit 13 mask
.equ ADC_WINLT_13_bp = 13                ; Window Low Threshold bit 13 position
.equ ADC_WINLT_14_bm = (1<<14)           ; Window Low Threshold bit 14 mask
.equ ADC_WINLT_14_bp = 14                ; Window Low Threshold bit 14 position
.equ ADC_WINLT_15_bm = (1<<15)           ; Window Low Threshold bit 15 mask
.equ ADC_WINLT_15_bp = 15                ; Window Low Threshold bit 15 position

; ADC_WINHT masks
.equ ADC_WINHT_gm = 0xFFFF               ; Window High Threshold group mask
.equ ADC_WINHT_gp = 0                    ; Window High Threshold group position
.equ ADC_WINHT_0_bm = (1<<0)             ; Window High Threshold bit 0 mask
.equ ADC_WINHT_0_bp = 0                  ; Window High Threshold bit 0 position
.equ ADC_WINHT_1_bm = (1<<1)             ; Window High Threshold bit 1 mask
.equ ADC_WINHT_1_bp = 1                  ; Window High Threshold bit 1 position
.equ ADC_WINHT_2_bm = (1<<2)             ; Window High Threshold bit 2 mask
.equ ADC_WINHT_2_bp = 2                  ; Window High Threshold bit 2 position
.equ ADC_WINHT_3_bm = (1<<3)             ; Window High Threshold bit 3 mask
.equ ADC_WINHT_3_bp = 3                  ; Window High Threshold bit 3 position
.equ ADC_WINHT_4_bm = (1<<4)             ; Window High Threshold bit 4 mask
.equ ADC_WINHT_4_bp = 4                  ; Window High Threshold bit 4 position
.equ ADC_WINHT_5_bm = (1<<5)             ; Window High Threshold bit 5 mask
.equ ADC_WINHT_5_bp = 5                  ; Window High Threshold bit 5 position
.equ ADC_WINHT_6_bm = (1<<6)             ; Window High Threshold bit 6 mask
.equ ADC_WINHT_6_bp = 6                  ; Window High Threshold bit 6 position
.equ ADC_WINHT_7_bm = (1<<7)             ; Window High Threshold bit 7 mask
.equ ADC_WINHT_7_bp = 7                  ; Window High Threshold bit 7 position
.equ ADC_WINHT_8_bm = (1<<8)             ; Window High Threshold bit 8 mask
.equ ADC_WINHT_8_bp = 8                  ; Window High Threshold bit 8 position
.equ ADC_WINHT_9_bm = (1<<9)             ; Window High Threshold bit 9 mask
.equ ADC_WINHT_9_bp = 9                  ; Window High Threshold bit 9 position
.equ ADC_WINHT_10_bm = (1<<10)           ; Window High Threshold bit 10 mask
.equ ADC_WINHT_10_bp = 10                ; Window High Threshold bit 10 position
.equ ADC_WINHT_11_bm = (1<<11)           ; Window High Threshold bit 11 mask
.equ ADC_WINHT_11_bp = 11                ; Window High Threshold bit 11 position
.equ ADC_WINHT_12_bm = (1<<12)           ; Window High Threshold bit 12 mask
.equ ADC_WINHT_12_bp = 12                ; Window High Threshold bit 12 position
.equ ADC_WINHT_13_bm = (1<<13)           ; Window High Threshold bit 13 mask
.equ ADC_WINHT_13_bp = 13                ; Window High Threshold bit 13 position
.equ ADC_WINHT_14_bm = (1<<14)           ; Window High Threshold bit 14 mask
.equ ADC_WINHT_14_bp = 14                ; Window High Threshold bit 14 position
.equ ADC_WINHT_15_bm = (1<<15)           ; Window High Threshold bit 15 mask
.equ ADC_WINHT_15_bp = 15                ; Window High Threshold bit 15 position

; ADC_TEMP masks
.equ ADC_TEMP_gm = 0xFF                  ; Temporary group mask
.equ ADC_TEMP_gp = 0                     ; Temporary group position
.equ ADC_TEMP_0_bm = (1<<0)              ; Temporary bit 0 mask
.equ ADC_TEMP_0_bp = 0                   ; Temporary bit 0 position
.equ ADC_TEMP_1_bm = (1<<1)              ; Temporary bit 1 mask
.equ ADC_TEMP_1_bp = 1                   ; Temporary bit 1 position
.equ ADC_TEMP_2_bm = (1<<2)              ; Temporary bit 2 mask
.equ ADC_TEMP_2_bp = 2                   ; Temporary bit 2 position
.equ ADC_TEMP_3_bm = (1<<3)              ; Temporary bit 3 mask
.equ ADC_TEMP_3_bp = 3                   ; Temporary bit 3 position
.equ ADC_TEMP_4_bm = (1<<4)              ; Temporary bit 4 mask
.equ ADC_TEMP_4_bp = 4                   ; Temporary bit 4 position
.equ ADC_TEMP_5_bm = (1<<5)              ; Temporary bit 5 mask
.equ ADC_TEMP_5_bp = 5                   ; Temporary bit 5 position
.equ ADC_TEMP_6_bm = (1<<6)              ; Temporary bit 6 mask
.equ ADC_TEMP_6_bp = 6                   ; Temporary bit 6 position
.equ ADC_TEMP_7_bm = (1<<7)              ; Temporary bit 7 mask
.equ ADC_TEMP_7_bp = 7                   ; Temporary bit 7 position

; Mode select
.equ ADC_MODE_SINGLE_8BIT_gc = (0x00<<4) ; Single 8-bit conv
.equ ADC_MODE_SINGLE_10BIT_gc = (0x01<<4) ; Single 10-bit conv
.equ ADC_MODE_SERIES_gc = (0x02<<4)      ; Series of 10-bit conv
.equ ADC_MODE_BURST_gc = (0x03<<4)       ; Burst of 10-bit conv
.equ ADC_MODE_ACCTEST_gc = (0x07<<4)     ; Acc test mode for FuSa

; Start Conversion select
.equ ADC_START_STOP_gc = (0x00<<0)       ; Stop/No ongoing conv
.equ ADC_START_IMMEDIATE_gc = (0x01<<0)  ; Start Immediately
.equ ADC_START_MUXPOS_WRITE_gc = (0x02<<0) ; Start after a write to MUXPOS
.equ ADC_START_EVENT_TTRIGGER_gc = (0x03<<0) ; Start upon event reception

; Clock Pre-scaler select
.equ ADC_PRESC_DIV2_gc = (0x00<<0)       ; CLK_PER divided by 2
.equ ADC_PRESC_DIV4_gc = (0x01<<0)       ; CLK_PER divided by 4
.equ ADC_PRESC_DIV6_gc = (0x02<<0)       ; CLK_PER divided by 6
.equ ADC_PRESC_DIV8_gc = (0x03<<0)       ; CLK_PER divided by 8
.equ ADC_PRESC_DIV10_gc = (0x04<<0)      ; CLK_PER divided by 10
.equ ADC_PRESC_DIV12_gc = (0x05<<0)      ; CLK_PER divided by 12
.equ ADC_PRESC_DIV14_gc = (0x06<<0)      ; CLK_PER divided by 14
.equ ADC_PRESC_DIV16_gc = (0x07<<0)      ; CLK_PER divided by 16
.equ ADC_PRESC_DIV20_gc = (0x08<<0)      ; CLK_PER divided by 20
.equ ADC_PRESC_DIV24_gc = (0x09<<0)      ; CLK_PER divided by 24
.equ ADC_PRESC_DIV28_gc = (0x0A<<0)      ; CLK_PER divided by 28
.equ ADC_PRESC_DIV32_gc = (0x0B<<0)      ; CLK_PER divided by 32
.equ ADC_PRESC_DIV40_gc = (0x0C<<0)      ; CLK_PER divided by 40
.equ ADC_PRESC_DIV48_gc = (0x0D<<0)      ; CLK_PER divided by 48
.equ ADC_PRESC_DIV56_gc = (0x0E<<0)      ; CLK_PER divided by 56
.equ ADC_PRESC_DIV64_gc = (0x0F<<0)      ; CLK_PER divided by 64

; Reference Selection
.equ ADC_REFSEL_VDD_gc = (0x00<<0)       ; VDD
.equ ADC_REFSEL_VREFA_gc = (0x02<<0)     ; VREFA
.equ ADC_REFSEL_1V024_gc = (0x04<<0)     ; 1.024V
.equ ADC_REFSEL_2V048_gc = (0x05<<0)     ; 2.048V
.equ ADC_REFSEL_4V096_gc = (0x06<<0)     ; 4.096V
.equ ADC_REFSEL_2V500_gc = (0x07<<0)     ; 2.5V

; Window Comparator Mode select
.equ ADC_WINCM_NONE_gc = (0x00<<0)       ; No Window Comparison
.equ ADC_WINCM_BELOW_gc = (0x01<<0)      ; Below Window
.equ ADC_WINCM_ABOVE_gc = (0x02<<0)      ; Above Window
.equ ADC_WINCM_INSIDE_gc = (0x03<<0)     ; Inside Window
.equ ADC_WINCM_OUTSIDE_gc = (0x04<<0)    ; Outside Window

; Sampling Number select
.equ ADC_SAMPNUM_NONE_gc = (0x00<<0)     ; No accumulation
.equ ADC_SAMPNUM_ACC2_gc = (0x01<<0)     ; 2 results accumulated
.equ ADC_SAMPNUM_ACC4_gc = (0x02<<0)     ; 4 results accumulated
.equ ADC_SAMPNUM_ACC8_gc = (0x03<<0)     ; 8 results accumulated
.equ ADC_SAMPNUM_ACC16_gc = (0x04<<0)    ; 16 results accumulated
.equ ADC_SAMPNUM_ACC32_gc = (0x05<<0)    ; 32 results accumulated
.equ ADC_SAMPNUM_ACC64_gc = (0x06<<0)    ; 64 results accumulated

; Analog Channel Selection Bits
.equ ADC_MUXPOS_AIN0_gc = (0x00<<0)      ; ADC input pin 0
.equ ADC_MUXPOS_AIN1_gc = (0x01<<0)      ; ADC input pin 1
.equ ADC_MUXPOS_AIN2_gc = (0x02<<0)      ; ADC input pin 2
.equ ADC_MUXPOS_AIN3_gc = (0x03<<0)      ; ADC input pin 3
.equ ADC_MUXPOS_AIN4_gc = (0x04<<0)      ; ADC input pin 4
.equ ADC_MUXPOS_AIN5_gc = (0x05<<0)      ; ADC input pin 5
.equ ADC_MUXPOS_AIN6_gc = (0x06<<0)      ; ADC input pin 6
.equ ADC_MUXPOS_AIN7_gc = (0x07<<0)      ; ADC input pin 7
.equ ADC_MUXPOS_AIN16_gc = (0x10<<0)     ; ADC input pin 16
.equ ADC_MUXPOS_AIN17_gc = (0x11<<0)     ; ADC input pin 17
.equ ADC_MUXPOS_AIN18_gc = (0x12<<0)     ; ADC input pin 18
.equ ADC_MUXPOS_AIN19_gc = (0x13<<0)     ; ADC input pin 19
.equ ADC_MUXPOS_AIN20_gc = (0x14<<0)     ; ADC input pin 20
.equ ADC_MUXPOS_AIN21_gc = (0x15<<0)     ; ADC input pin 21
.equ ADC_MUXPOS_AIN22_gc = (0x16<<0)     ; ADC input pin 22
.equ ADC_MUXPOS_AIN23_gc = (0x17<<0)     ; ADC input pin 23
.equ ADC_MUXPOS_AIN24_gc = (0x18<<0)     ; ADC input pin 24
.equ ADC_MUXPOS_AIN25_gc = (0x19<<0)     ; ADC input pin 25
.equ ADC_MUXPOS_AIN26_gc = (0x1A<<0)     ; ADC input pin 26
.equ ADC_MUXPOS_AIN27_gc = (0x1B<<0)     ; ADC input pin 27
.equ ADC_MUXPOS_AIN31_gc = (0x1F<<0)     ; ADC input pin 31
.equ ADC_MUXPOS_GND_gc = (0x40<<0)       ; Ground
.equ ADC_MUXPOS_TEMPSENSE_gc = (0x42<<0) ; Temperature sensor
.equ ADC_MUXPOS_VDDDIV10_gc = (0x44<<0)  ; VDD/10
.equ ADC_MUXPOS_DACREF0_gc = (0x49<<0)   ; AC0 DAC voltage


;*************************************************************************
;** BOD - Bod interface
;*************************************************************************

; BOD_CTRLA masks
.equ BOD_SLEEP_gm = 0x03                 ; Operation in sleep mode group mask
.equ BOD_SLEEP_gp = 0                    ; Operation in sleep mode group position
.equ BOD_SLEEP_0_bm = (1<<0)             ; Operation in sleep mode bit 0 mask
.equ BOD_SLEEP_0_bp = 0                  ; Operation in sleep mode bit 0 position
.equ BOD_SLEEP_1_bm = (1<<1)             ; Operation in sleep mode bit 1 mask
.equ BOD_SLEEP_1_bp = 1                  ; Operation in sleep mode bit 1 position
.equ BOD_ACTIVE_gm = 0x0C                ; Operation in active mode group mask
.equ BOD_ACTIVE_gp = 2                   ; Operation in active mode group position
.equ BOD_ACTIVE_0_bm = (1<<2)            ; Operation in active mode bit 0 mask
.equ BOD_ACTIVE_0_bp = 2                 ; Operation in active mode bit 0 position
.equ BOD_ACTIVE_1_bm = (1<<3)            ; Operation in active mode bit 1 mask
.equ BOD_ACTIVE_1_bp = 3                 ; Operation in active mode bit 1 position
.equ BOD_SAMPFREQ_bm = 0x10              ; Sample frequency bit mask
.equ BOD_SAMPFREQ_bp = 4                 ; Sample frequency bit position

; BOD_CTRLB masks
.equ BOD_LVL_gm = 0x07                   ; Bod level group mask
.equ BOD_LVL_gp = 0                      ; Bod level group position
.equ BOD_LVL_0_bm = (1<<0)               ; Bod level bit 0 mask
.equ BOD_LVL_0_bp = 0                    ; Bod level bit 0 position
.equ BOD_LVL_1_bm = (1<<1)               ; Bod level bit 1 mask
.equ BOD_LVL_1_bp = 1                    ; Bod level bit 1 position
.equ BOD_LVL_2_bm = (1<<2)               ; Bod level bit 2 mask
.equ BOD_LVL_2_bp = 2                    ; Bod level bit 2 position

; BOD_VLMCTRLA masks
.equ BOD_VLMLVL_gm = 0x03                ; voltage level monitor level group mask
.equ BOD_VLMLVL_gp = 0                   ; voltage level monitor level group position
.equ BOD_VLMLVL_0_bm = (1<<0)            ; voltage level monitor level bit 0 mask
.equ BOD_VLMLVL_0_bp = 0                 ; voltage level monitor level bit 0 position
.equ BOD_VLMLVL_1_bm = (1<<1)            ; voltage level monitor level bit 1 mask
.equ BOD_VLMLVL_1_bp = 1                 ; voltage level monitor level bit 1 position

