pkwasniok/avr-db-template/lib/atpack/avrasm/inc/AVR16DU28def.inc
; USB_INTFLAGSB masks
; Masks for USB_SETUP already defined
; Masks for USB_GNDONE already defined
.equ USB_RMWBUSY_bm = 0x04               ; RMW Busy Flag bit mask
.equ USB_RMWBUSY_bp = 2                  ; RMW Busy Flag bit position
; Masks for USB_TRNCOMPL already defined

; Data Size default select
.equ USB_EP_DEFAULT_BUFSIZE_BUF8_gc = (0x00<<0) ; 8 bytes buffer size
.equ USB_EP_DEFAULT_BUFSIZE_BUF16_gc = (0x01<<0) ; 16 bytes buffer size
.equ USB_EP_DEFAULT_BUFSIZE_BUF32_gc = (0x02<<0) ; 32 bytes buffer size
.equ USB_EP_DEFAULT_BUFSIZE_BUF64_gc = (0x03<<0) ; 64 bytes buffer size

; Endpoint type select
.equ USB_EP_TYPE_DISABLE_gc = (0x00<<6)  ; Endpoint Disabled
.equ USB_EP_TYPE_CONTROL_gc = (0x01<<6)  ; Control
.equ USB_EP_TYPE_BULKINT_gc = (0x02<<6)  ; Bulk or Interrupt
.equ USB_EP_TYPE_ISO_gc = (0x03<<6)      ; Isochronous

; Data Size isochronous select
.equ USB_EP_ISO_BUFSIZE_BUF8_gc = (0x00<<0) ; 8 bytes buffer size
.equ USB_EP_ISO_BUFSIZE_BUF16_gc = (0x01<<0) ; 16 bytes buffer size
.equ USB_EP_ISO_BUFSIZE_BUF32_gc = (0x02<<0) ; 32 bytes buffer size
.equ USB_EP_ISO_BUFSIZE_BUF64_gc = (0x03<<0) ; 64 bytes buffer size
.equ USB_EP_ISO_BUFSIZE_BUF128_gc = (0x04<<0) ; 128 bytes buffer size
.equ USB_EP_ISO_BUFSIZE_BUF256_gc = (0x05<<0) ; 256 bytes buffer size
.equ USB_EP_ISO_BUFSIZE_BUF512_gc = (0x06<<0) ; 512 bytes buffer size
.equ USB_EP_ISO_BUFSIZE_BUF1023_gc = (0x07<<0) ; 1023 bytes buffer size

; Endpoint Direction select
.equ USB_EP_TABLE_DIR_OUT_gc = (0x00<<3) ; OUT Endpoint
.equ USB_EP_TABLE_DIR_IN_gc = (0x01<<3)  ; In Endpoint

; Data Toggle select
.equ USB_EP_DEFAULT_TOGGLE_DATA0_gc = (0x00<<0) ; DATA0 PID in next transaction
.equ USB_EP_DEFAULT_TOGGLE_DATA1_gc = (0x01<<0) ; DATA1 PID in next transaction


;*************************************************************************
;** USERROW - User Row
;*************************************************************************


;*************************************************************************
;** VPORT - Virtual Ports
;*************************************************************************

; VPORT_INTFLAGS masks
.equ VPORT_INT_gm = 0xFF                 ; Pin Interrupt Flag group mask
.equ VPORT_INT_gp = 0                    ; Pin Interrupt Flag group position
.equ VPORT_INT_0_bm = (1<<0)             ; Pin Interrupt Flag bit 0 mask
.equ VPORT_INT_0_bp = 0                  ; Pin Interrupt Flag bit 0 position
.equ VPORT_INT_1_bm = (1<<1)             ; Pin Interrupt Flag bit 1 mask
.equ VPORT_INT_1_bp = 1                  ; Pin Interrupt Flag bit 1 position
.equ VPORT_INT_2_bm = (1<<2)             ; Pin Interrupt Flag bit 2 mask
.equ VPORT_INT_2_bp = 2                  ; Pin Interrupt Flag bit 2 position
.equ VPORT_INT_3_bm = (1<<3)             ; Pin Interrupt Flag bit 3 mask
.equ VPORT_INT_3_bp = 3                  ; Pin Interrupt Flag bit 3 position
.equ VPORT_INT_4_bm = (1<<4)             ; Pin Interrupt Flag bit 4 mask
.equ VPORT_INT_4_bp = 4                  ; Pin Interrupt Flag bit 4 position
.equ VPORT_INT_5_bm = (1<<5)             ; Pin Interrupt Flag bit 5 mask
.equ VPORT_INT_5_bp = 5                  ; Pin Interrupt Flag bit 5 position
.equ VPORT_INT_6_bm = (1<<6)             ; Pin Interrupt Flag bit 6 mask
.equ VPORT_INT_6_bp = 6                  ; Pin Interrupt Flag bit 6 position
.equ VPORT_INT_7_bm = (1<<7)             ; Pin Interrupt Flag bit 7 mask
.equ VPORT_INT_7_bp = 7                  ; Pin Interrupt Flag bit 7 position


;*************************************************************************
;** VREF - Voltage reference
;*************************************************************************

; VREF_ACREF masks
.equ VREF_REFSEL_gm = 0x07               ; Reference select group mask
.equ VREF_REFSEL_gp = 0                  ; Reference select group position
.equ VREF_REFSEL_0_bm = (1<<0)           ; Reference select bit 0 mask
.equ VREF_REFSEL_0_bp = 0                ; Reference select bit 0 position
.equ VREF_REFSEL_1_bm = (1<<1)           ; Reference select bit 1 mask
.equ VREF_REFSEL_1_bp = 1                ; Reference select bit 1 position
.equ VREF_REFSEL_2_bm = (1<<2)           ; Reference select bit 2 mask
.equ VREF_REFSEL_2_bp = 2                ; Reference select bit 2 position
.equ VREF_ALWAYSON_bm = 0x80             ; Always on bit mask
.equ VREF_ALWAYSON_bp = 7                ; Always on bit position

; Reference select
.equ VREF_REFSEL_1V024_gc = (0x00<<0)    ; Internal 1.024V reference
.equ VREF_REFSEL_2V048_gc = (0x01<<0)    ; Internal 2.048V reference
.equ VREF_REFSEL_4V096_gc = (0x02<<0)    ; Internal 4.096V reference
.equ VREF_REFSEL_2V500_gc = (0x03<<0)    ; Internal 2.500V reference
.equ VREF_REFSEL_VDD_gc = (0x05<<0)      ; VDD as reference
.equ VREF_REFSEL_VREFA_gc = (0x06<<0)    ; External reference on VREFA pin


;*************************************************************************
;** WDT - Watch-Dog Timer
;*************************************************************************

; WDT_CTRLA masks
.equ WDT_PERIOD_gm = 0x0F                ; Period group mask
.equ WDT_PERIOD_gp = 0                   ; Period group position
.equ WDT_PERIOD_0_bm = (1<<0)            ; Period bit 0 mask
.equ WDT_PERIOD_0_bp = 0                 ; Period bit 0 position
.equ WDT_PERIOD_1_bm = (1<<1)            ; Period bit 1 mask
.equ WDT_PERIOD_1_bp = 1                 ; Period bit 1 position
.equ WDT_PERIOD_2_bm = (1<<2)            ; Period bit 2 mask
.equ WDT_PERIOD_2_bp = 2                 ; Period bit 2 position
.equ WDT_PERIOD_3_bm = (1<<3)            ; Period bit 3 mask
.equ WDT_PERIOD_3_bp = 3                 ; Period bit 3 position
.equ WDT_WINDOW_gm = 0xF0                ; Window group mask
.equ WDT_WINDOW_gp = 4                   ; Window group position
.equ WDT_WINDOW_0_bm = (1<<4)            ; Window bit 0 mask
.equ WDT_WINDOW_0_bp = 4                 ; Window bit 0 position
.equ WDT_WINDOW_1_bm = (1<<5)            ; Window bit 1 mask
.equ WDT_WINDOW_1_bp = 5                 ; Window bit 1 position
.equ WDT_WINDOW_2_bm = (1<<6)            ; Window bit 2 mask
.equ WDT_WINDOW_2_bp = 6                 ; Window bit 2 position
.equ WDT_WINDOW_3_bm = (1<<7)            ; Window bit 3 mask
.equ WDT_WINDOW_3_bp = 7                 ; Window bit 3 position

; WDT_STATUS masks
.equ WDT_SYNCBUSY_bm = 0x01              ; Syncronization busy bit mask
.equ WDT_SYNCBUSY_bp = 0                 ; Syncronization busy bit position
.equ WDT_LOCK_bm = 0x80                  ; Lock enable bit mask
.equ WDT_LOCK_bp = 7                     ; Lock enable bit position

; Period select
.equ WDT_PERIOD_OFF_gc = (0x00<<0)       ; Off
.equ WDT_PERIOD_8CLK_gc = (0x01<<0)      ; 8 cycles (8ms)
.equ WDT_PERIOD_16CLK_gc = (0x02<<0)     ; 16 cycles (16ms)
.equ WDT_PERIOD_32CLK_gc = (0x03<<0)     ; 32 cycles (32ms)
.equ WDT_PERIOD_64CLK_gc = (0x04<<0)     ; 64 cycles (64ms)
.equ WDT_PERIOD_128CLK_gc = (0x05<<0)    ; 128 cycles (0.128s)
.equ WDT_PERIOD_256CLK_gc = (0x06<<0)    ; 256 cycles (0.256s)
.equ WDT_PERIOD_512CLK_gc = (0x07<<0)    ; 512 cycles (0.512s)
.equ WDT_PERIOD_1KCLK_gc = (0x08<<0)     ; 1K cycles (1.0s)
.equ WDT_PERIOD_2KCLK_gc = (0x09<<0)     ; 2K cycles (2.0s)
.equ WDT_PERIOD_4KCLK_gc = (0x0A<<0)     ; 4K cycles (4.1s)
.equ WDT_PERIOD_8KCLK_gc = (0x0B<<0)     ; 8K cycles (8.2s)

; Window select
.equ WDT_WINDOW_OFF_gc = (0x00<<4)       ; Off
.equ WDT_WINDOW_8CLK_gc = (0x01<<4)      ; 8 cycles (8ms)
.equ WDT_WINDOW_16CLK_gc = (0x02<<4)     ; 16 cycles (16ms)
.equ WDT_WINDOW_32CLK_gc = (0x03<<4)     ; 32 cycles (32ms)
.equ WDT_WINDOW_64CLK_gc = (0x04<<4)     ; 64 cycles (64ms)
.equ WDT_WINDOW_128CLK_gc = (0x05<<4)    ; 128 cycles (0.128s)
.equ WDT_WINDOW_256CLK_gc = (0x06<<4)    ; 256 cycles (0.256s)
.equ WDT_WINDOW_512CLK_gc = (0x07<<4)    ; 512 cycles (0.512s)
.equ WDT_WINDOW_1KCLK_gc = (0x08<<4)     ; 1K cycles (1.0s)
.equ WDT_WINDOW_2KCLK_gc = (0x09<<4)     ; 2K cycles (2.0s)
.equ WDT_WINDOW_4KCLK_gc = (0x0A<<4)     ; 4K cycles (4.1s)
.equ WDT_WINDOW_8KCLK_gc = (0x0B<<4)     ; 8K cycles (8.2s)




; ***** CPU REGISTER DEFINITIONS *****************************************
.def	XH	= r27
.def	XL	= r26
.def	YH	= r29
.def	YL	= r28
.def	ZH	= r31
.def	ZL	= r30


; ***** DATA MEMORY DECLARATIONS *****************************************


#define DATAMEM_START 0x0000
#define DATAMEM_SIZE 0x10000
#define DATAMEM_END (0x0000 + 0x10000 - 1)

#define IO_START 0x0000
#define IO_SIZE 0x103F
#define IO_END (0x0000 + 0x103F - 1)

